app/views/trainings/index.html.erb

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = $1 LIMIT 1  [["id", 1]]
---
                              <td>
                                <% if(Instructor.find_by(id: f.instructor_id)) %>