app/views/trainings/show.html.erb

                        </li>
                        <% if(Institution.find_by_id(@training.institution_id)) %>
---
SELECT  "institutions".* FROM "institutions" WHERE "institutions"."id" = $1 LIMIT 1  [["id", nil]]

                        <%end%>
                        <% if(Instructor.find_by_id(@training.instructor_id)) %>
---
SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = $1 LIMIT 1  [["id", 1]]


                            <% if @training.employees.any? %>
---
SELECT  1 AS one FROM "employees" INNER JOIN "training_employees" ON "employees"."id" = "training_employees"."employee_id" WHERE "training_employees"."training_id" = $1 LIMIT 1  [["training_id", 2]]
SELECT "employees".* FROM "employees" INNER JOIN "training_employees" ON "employees"."id" = "training_employees"."employee_id" WHERE "training_employees"."training_id" = $1  [["training_id", 2]]

                                        <td><%= link_to f.name, employee_path(f) %></td>
                                        <%if TrainingEmployee.where("training_id = ? AND employee_id = ?", @training.id, f.id).first.asistencia  %>
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", nil]]
SELECT  "training_employees".* FROM "training_employees" WHERE (training_id = 2 AND employee_id = 1)  ORDER BY "training_employees"."id" ASC LIMIT 1

          <%= f.label :employee_id, "Numero de Empleado" %>
          <%= f.select(:employee_id, options_for_select(Employee.all.pluck(:name, :id)))%>
---
SELECT "employees"."name", "employees"."id" FROM "employees" WHERE (employee_status = true)

          <%= f.label :instructor_id, "Instructor" %>
          <%= f.select(:instructor_id, options_for_select(Institution.find_by_id(@training.institution_id).instructors.pluck(:name, :id)))%>
---
SELECT "instructors"."name", "instructors"."id" FROM "instructors" WHERE "instructors"."institution_id" = $1  [["institution_id", 1]]