app/views/employees/_form.html.erb

                  <%= f.label :work_structure_id, "Puesto" %>
                  <%= f.select(:work_structure_id, options_for_select(WorkStructure.all.pluck(:department, :id)))%>
---
SELECT "work_structures"."department", "work_structures"."id" FROM "work_structures"