app/views/employees/show.html.erb

                      <ul class="list-unstyled user_data">
                        <%if(WorkStructure.find(@employee.work_structure_id)) %>
---
SELECT  "work_structures".* FROM "work_structures" WHERE "work_structures"."id" = $1 LIMIT 1  [["id", 0]]

                      <h4>Habilidades</h4>
                      <% if @employee.abilities.any? %>
---
SELECT  1 AS one FROM "abilities" INNER JOIN "employee_abilities" ON "abilities"."id" = "employee_abilities"."ability_id" WHERE "employee_abilities"."employee_id" = $1 LIMIT 1  [["employee_id", 1]]
SELECT "abilities".* FROM "abilities" INNER JOIN "employee_abilities" ON "abilities"."id" = "employee_abilities"."ability_id" WHERE "employee_abilities"."employee_id" = $1  [["employee_id", 1]]


                            <% if @employee.educations.any? %>
---
SELECT  1 AS one FROM "educations" WHERE "educations"."employee_id" = $1 LIMIT 1  [["employee_id", 1]]
SELECT "educations".* FROM "educations" WHERE "educations"."employee_id" = $1  [["employee_id", 1]]

                          <div role="tabpanel" class="tab-pane fade" id="tab_content3" aria-labelledby="profile-tab" style="text-align: center">
                            <% if @employee.work_exps.any? %>
---
SELECT  1 AS one FROM "work_exps" WHERE "work_exps"."employee_id" = $1 LIMIT 1  [["employee_id", 1]]
SELECT "work_exps".* FROM "work_exps" WHERE "work_exps"."employee_id" = $1  [["employee_id", 1]]

                          <div role="tabpanel" class="tab-pane fade" id="tab_content4" aria-labelledby="profile-tab" style="text-align: center">
                            <% if @employee.dependants.any? %>
---
SELECT "dependants".* FROM "dependants" WHERE "dependants"."employee_id" = $1  [["employee_id", 1]]

                          <div role="tabpanel" class="tab-pane fade" id="tab_content5" aria-labelledby="profile-tab">
                            <% if @employee.trainings.any? %>
---
SELECT  1 AS one FROM "trainings" INNER JOIN "training_employees" ON "trainings"."id" = "training_employees"."training_id" WHERE "training_employees"."employee_id" = $1 LIMIT 1  [["employee_id", 1]]
SELECT "trainings".* FROM "trainings" INNER JOIN "training_employees" ON "trainings"."id" = "training_employees"."training_id" WHERE "training_employees"."employee_id" = $1  [["employee_id", 1]]

                                      <td><%= f.start_date %></td>
                                      <%if TrainingEmployee.where("training_id = ? AND employee_id = ?", f.id, @employee.id).first.asistencia  %>
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "training_employees".* FROM "training_employees" WHERE (training_id = 2 AND employee_id = 1)  ORDER BY "training_employees"."id" ASC LIMIT 1

                          <div role="tabpanel" class="tab-pane fade" id="tab_content6" aria-labelledby="profile-tab" style="text-align: center">
                            <% if @employee.hours.any? %>
---
SELECT "hours".* FROM "hours" WHERE "hours"."employee_id" = $1  [["employee_id", 1]]

                  <%= f.label :ability_id, "Puesto" %>
                  <%= f.select(:ability_id, options_for_select(Ability.all.pluck(:ability, :id)))%>
---
SELECT "abilities"."ability", "abilities"."id" FROM "abilities"