app/views/employees/show.html.erb

SELECT "abilities"."ability", "abilities"."id" FROM "abilities" INNER JOIN "work_structure_abilities" ON "abilities"."id" = "work_structure_abilities"."ability_id" WHERE "work_structure_abilities"."work_structure_id" = $1  [["work_structure_id", 1]]
---
                  <%= f.label :ability_id, "Puesto" %>
                  <%= f.select(:ability_id, options_for_select(WorkStructure.find_by_id(@employee.work_structure_id).abilities.pluck(:ability, :id)))%>