app/views/work_structures/show.html.erb

SELECT  1 AS one FROM "employees" WHERE "employees"."work_structure_id" = $1 LIMIT 1  [["work_structure_id", 1]]
SELECT "employees".* FROM "employees" WHERE "employees"."work_structure_id" = $1  [["work_structure_id", 1]]
---
            <h3>Empleados</h3>
              <% if @work_structure.employees.any? %>

SELECT  1 AS one FROM "abilities" INNER JOIN "work_structure_abilities" ON "abilities"."id" = "work_structure_abilities"."ability_id" WHERE "work_structure_abilities"."work_structure_id" = $1 LIMIT 1  [["work_structure_id", 1]]
SELECT "abilities".* FROM "abilities" INNER JOIN "work_structure_abilities" ON "abilities"."id" = "work_structure_abilities"."ability_id" WHERE "work_structure_abilities"."work_structure_id" = $1  [["work_structure_id", 1]]
---
                <h3>Habilidades</h3>
                  <% if @work_structure.abilities.any? %>

SELECT "abilities"."ability", "abilities"."id" FROM "abilities"
---
          <%= f.label :ability_id, "Puesto" %>
          <%= f.select(:ability_id, options_for_select(Ability.all.pluck(:ability, :id)))%>