app/views/work_structures/show.html.erb

                            <div role="tabpanel" class="tab-pane fade" id="tab_content4" aria-labelledby="profile-tab" style="text-align: center">
                              <% if @work_structure.work_structure_abilities.any? %>
---
SELECT "work_structure_abilities".* FROM "work_structure_abilities" WHERE "work_structure_abilities"."work_structure_id" = $1  [["work_structure_id", 1]]