app/controllers/dependants_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
  @employee = Employee.find(params[:employee_id])

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "dependants" ("name", "relation", "employee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Johan Salazar"], ["relation", "Hermano"], ["employee_id", 1], ["created_at", "2017-03-09 02:42:21.038440"], ["updated_at", "2017-03-09 02:42:21.038440"]]
---
  def create
  @employee = Employee.find(params[:employee_id])
  @dependant = @employee.dependants.build(dependants_params)

  if @dependant.save