app/controllers/employees_controller.rb

  def bonoEducativo
    Employee.TieneHijosMenores
    @employees = Employee.where(hasChildren: true)
---
SELECT "employees".* FROM "employees" WHERE "employees"."hasChildren" = $1  [["hasChildren", "t"]]