app/controllers/fake_abilities_controller.rb

  def new
  @employee = Employee.find(params[:employee_id])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]

  def create
  @employee = Employee.find(params[:employee_id])
  @fake_ability = @employee.fake_abilities.build(fake_abilities_params)

  if @fake_ability.save
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "fake_abilities" ("training_name", "employee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["training_name", "Ejemplo2"], ["employee_id", 1], ["created_at", "2017-03-09 13:34:59.149663"], ["updated_at", "2017-03-09 13:34:59.149663"]]