app/controllers/institutions_controller.rb

SELECT "institutions".* FROM "institutions"
---
  def index
    @institutions = Institution.all

INSERT INTO "institutions" ("name", "email", "description", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
  @institution = Institution.new(institution_params)

  if @institution.save

SELECT  "institutions".* FROM "institutions" WHERE "institutions"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
   @institution = Institution.find(params[:id])