app/controllers/instructors_controller.rb

  def new
 @institution = Institution.find(params[:institution_id])
---
SELECT  "institutions".* FROM "institutions" WHERE "institutions"."id" = $1 LIMIT 1  [["id", 1]]

 def create
   @institution = Institution.find(params[:institution_id])
   @instructor = @institution.instructors.build(instructor_params)

 if @instructor.save
---
SELECT  "institutions".* FROM "institutions" WHERE "institutions"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "instructors" ("name", "email", "description", "phone", "institution_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"