app/controllers/trainings_controller.rb

SELECT "trainings".* FROM "trainings" WHERE (start_date >= '2017-05-04 22:57:24.493217' AND planned = false)  ORDER BY "trainings"."start_date" ASC
---
  def index
    @trainingafter = Training.where("start_date >= ?",Time.now).order(:start_date)

INSERT INTO "trainings" ("training_name", "start_date", "check_employee", "check_intern", "check_exterior", "institution_id", "duration", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @training = Training.new(training_params)

    if @training.save

SELECT  "trainings".* FROM "trainings" WHERE "trainings"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
      @training = Training.find(params[:id])

SELECT  "trainings".* FROM "trainings" WHERE "trainings"."id" = $1 LIMIT 1  [["id", 2]]
---
  def edit
    @training = Training.find(params[:id])

SELECT  "trainings".* FROM "trainings" WHERE "trainings"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "trainings" SET "instructor_id" = $1, "updated_at" = $2 WHERE "trainings"."id" = $3  [["instructor_id", 1], ["updated_at", "2017-03-24 16:55:38.915923"], ["id", 3]]
---
  def update
    @training = Training.find(params[:id])

    if @training.update_attributes(training_params)

SELECT  "trainings".* FROM "trainings" WHERE "trainings"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "trainings" WHERE "trainings"."id" = $1  [["id", 1]]
---
  def destroy
    @training = Training.find(params[:id])
    @training.destroy