app/controllers/training_employees_controller.rb

  def create
  @training = Training.find(params[:training_id])
  @training_employee = @training.training_employees.build(training_employees_params)

  if @training_employee.save
---
SELECT  "trainings".* FROM "trainings" WHERE "trainings"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "training_employees" ("employee_id", "training_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["employee_id", 1], ["training_id", 2], ["created_at", "2017-03-23 04:19:36.446928"], ["updated_at", "2017-03-23 04:19:36.446928"]]

def update
  @training = Training.find(params[:training_id])
  @training_employee = TrainingEmployee.find(params[:id])
  if @training_employee.update_attributes(training_employees_params)
---
SELECT  "trainings".* FROM "trainings" WHERE "trainings"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "training_employees".* FROM "training_employees" WHERE "training_employees"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "training_employees" SET "asistencia" = $1, "updated_at" = $2 WHERE "training_employees"."id" = $3  [["asistencia", "t"], ["updated_at", "2017-03-23 19:34:47.288190"], ["id", 4]]