app/controllers/trainings_controller.rb

  def index
    @trainings = Training.all
---
SELECT "trainings".* FROM "trainings"