app/controllers/work_structure_abilities_controller.rb

SELECT  "work_structures".* FROM "work_structures" WHERE "work_structures"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "work_structure_abilities" ("ability_id", "work_structure_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["ability_id", 1], ["work_structure_id", 1], ["created_at", "2017-03-22 05:03:47.787912"], ["updated_at", "2017-03-22 05:03:47.787912"]]
---
  def create
  @work_structure = WorkStructure.find(params[:work_structure_id])
  @work_structure_ability = @work_structure.work_structure_abilities.build(work_structure_abilities_params)

  if @work_structure_ability.save