app/controllers/work_structures_controller.rb

SELECT "work_structures".* FROM "work_structures"
---
  def index
    @work_structures = WorkStructure.all

SELECT  "work_structures".* FROM "work_structures" WHERE "work_structures"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @work_structure = WorkStructure.find(params[:id])

INSERT INTO "work_structures" ("department", "area", "sub_area", "area_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["department", ""], ["area", ""], ["sub_area", ""], ["area_code", ""], ["created_at", "2017-05-10 22:34:54.802381"], ["updated_at", "2017-05-10 22:34:54.802381"]]
---
  def create
    @work_structure = WorkStructure.new(work_structure_params)

    if @work_structure.save