app/controllers/work_exps_controller.rb

  def new
  @employee = Employee.find(params[:employee_id])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]

  def create
  @employee = Employee.find(params[:employee_id])
  @work_exp = @employee.work_exps.build(work_exps_params)

  if @work_exp.save
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "work_exps" ("company_name", "position", "year_start", "year_end", "constancia", "employee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"